nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.h
 *        driver. Application code need to do with the clock gate/ungate himself/herself.
 *      - EDMA_ENTER_CRITICAL_SECTION/EDMA_LEAVE_CRITICAL_SECTION
 *        These access protection macros is disabled by default in driver, application could overwrite it for the tcd
 *        pool access protection if multiple task would like to access the same channel.
 *
 *    + Steps shall be covered in application codes rather than in driver
 *      - Same as functional layer except that interrupt entry need not be setup by user.
 *
 *    + Driver Interface invoking Sequence
 *      - Initialize the eDMA peripheral
 *        Use the eDMA Initialization and De-initialization Interfaces. eDMA driver provides an interface
 *        EDMA_Init which is target for whole module configurations, channel transfer configuration should not be
 *        submitted with EDMA_Init while using transactional layer.

 *      - [Optional]Application can use eDMA non-channel
 *        functional interfaces for specific general feature enable.
 *
 *      - Init the handle by calling EDMA_TransferCreateHandle with optional callback provided and provide driver
 *        the software TCD memory and how many TCD slots supported.
 *        Note that user shall make sure this memory is always alive unless it is no longer used and make sure
 *        the memory in a strongly ordered memory region.

 *      - Configure the Transfer
 *        + For Loop transfer, call EDMA_TransferSubmitLoopTransfer, note that do not start the transfer before loop
 *          configuration is done
 *        + For non-loop transfer, call EDMA_TransferSubmitSingleTransfer, user can submit the transfer request any time
 *          the install software TCD buffer still get empty slots. User can submit the non-loop transfer request
 *          before/after start of the transfer.

 *      - Start/Stop/Abort channel use the EDMA_TransferStart/EDMA_TransferStop/EDMA_TransferAbort

 *      - Handle transfer completion
 *        + User's code will be executed on completion of transfer or transfers where it is provided in callback
 *          function on EDMA_TransferCreateHandle.
 *        + The callback function can be called on completion of each TCD and callback function will be assigned
 *          with parameter that how many TCDs are completed that you need to re-setup these memory buffer. When system
 *          is in heavy load by other higher priority interrupt that there maybe the case that 2 or more TCD completion
 *          trigger only one callback.
 *
 *  Typical Use Cases
 *  ================
 *  1. Single transfer(using edma channel functional layer)
 *     For a single one shot transfer,
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferMemoryToMemory);
 *		psTransfer->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *     For advance transfer case with modulo feature
 *     @code
 *      psTransfer.pSrcAddr = xxx;
 *      psTransfer.pDstAddr = xxx;
 *      psTransfer.eSrcWidthOfEachTransfer = kEDMA_TransferWidth32Bits;
 *      psTransfer.eDstWidthOfEachTransfer = kEDMA_TransferWidth32Bits;
 *      psTransfer.i16SrcOffsetOfEachTransfer = 4U;
 *      psTransfer.i16DstOffsetOfEachTransfer = 4U;
 *      psTransfer.u32BytesEachRequest = 4;
 *      psTransfer.u32TotalBytes = 256;
 *      psTransfer.eSrcAddrModulo = kEDMA_ChannelModulo256bytes;
 *      psTransfer.u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *
 *  2. Scatter gather transfer(using edma channel functional layer)
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferMemoryToMemory);
 *      psTransfer->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      EDMA_ConfigChannelSoftwareTCD(tcd, &transferConfig);
 *      psTransfer->psLinkTCD = tcd;
 *
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *
 *  3. Loop transfer(using edma software TCD interfaces)
 *     @code
 *      EDMA_GetDefaultConfig(&config);
 *      EDMA_Init(DMA, channel, &config);
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer0, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferMemoryToMemory);
 *      psTransfer0->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer1, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferMemoryToMemory);
 *      psTransfer1->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *
 *      psTransfer0->psLinkTCD = tcd[1];
 *      psTransfer1->psLinkTCD = tcd[0];
 *      EDMA_ConfigChannelSoftwareTCD(&tcd[0], &psTransfer0);
 *      EDMA_ConfigChannelSoftwareTCD(&tcd[1], &psTransfer1);
 *      EDMA_InstallChannelSoftwareTCD(base, channel, tcd0);
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *
 *  4. Channel link(using edma initialization and de-initialization interface)
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer0, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferMemoryToMemory);
 *      psTransfer0->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer1, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferMemoryToMemory);
 *      psTransfer1->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      psTransfer0->bEnableChannelMinorLoopLink = true;
 *      psTransfer0->eMinorLoopLinkChannel = 1;
 *
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0] = &psTransfer0;
 *      config.psChannelTransferConfig[1] = &psTransfer1;
 *
 *      EDMA_Init(DMA, &config);
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferMemoryToMemory);
 *      config.bEnableChannelMinorLoopLink = true;
 *      config.eMinorLoopLinkChannel = channel1;
 *      config.u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *
 *  5. Single transfer (using edma transactional layer)
 *     @code
 *
 *      EDMA_TransferCreateHandle(handle, base, channel, tcdPool, tcdPoolCount, callback, userdata)
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer, srcAddr, dstAddr,bytesEachRequest,
 *                                         totalBytes, eWidth, kEDMA_ChannelTransferMemoryToMemory);
 *      psTransfer->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      EDMA_TransferSubmitSingleTransfer(handle, psTransfer0);
 *      EDMA_TransferStart(handle);
 *     @endcode
 *
 *  6. Continuous single transfer request(using transactional layer dynamic scatter gather feature)
 *     @code
 *      EDMA_TransferCreateHandle(handle, base, channel, tcdPool, tcdPoolCount, callback, userdata)
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer0, srcAddr, dstAddr,bytesEachRequest,
 *                                         totalBytes, eWidth, kEDMA_ChannelTransferMemoryToMemory);
 *      psTransfer->u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      psTransfer->srcAddrModulo = xxx;
 *      EDMA_TransferSubmitSingleTransfer(handle, psTransfer0);
 *      EDMA_TransferStart(handle);
 *
 *      EDMA_TransferSubmitSingleTransfer(handle, psTransfer1);
 *      EDMA_TransferSubmitSingleTransfer(handle, psTransfer2);
 *      .....
 *     @endcode
 *
 *  7. Loop transfer request(using transactional layer)
 *     @code
 *      EDMA_TransferCreateHandle(handle, base, channel, tcdPool, tcdPoolCount, callback, userdata);
 *
 *      EDMA_GetChannelDefaultTransferConfig(&scatterGather[0],srcAddr,dstAddr,bytesEachRequest,totalBytes,eWidth,
 *      kEDMA_ChannelTransferMemoryToMemory);
 *      scatterGather[0].u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *      EDMA_GetChannelDefaultTransferConfig(&scatterGather[1],srcAddr,dstAddr,bytesEachRequest,totalBytes,eWidth,
 *      kEDMA_ChannelTransferMemoryToMemory);
 *      scatterGather[0].u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *
 *      EDMA_TransferSubmitLoopTransfer(handle, &scatterGather[0], 2U);
 *      EDMA_TransferStart(handle);
 *     @endcode
 *
 *  8. Transfer between peripheral(one fifo only) and memory (using edma channel functional layer)\n
 *     Peripheral to memory:
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferPeripheralToMemory);
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *
 *     Memory to peripheral：
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannrlTransferMemoryToPeripheral);
 *      psTransfer.u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *      EDMA_EnableChannelRequest(base, channel, true);
 *
 *     @endcode
 *
 *  9. Transfer between peripheral(multi fifo, assume fifo number 4, fifo address offset 4) and memory. \n
 *     Peripheral to memory, reading 4 fifo data from peripheral and write to continuous memory block(using edma channel
 *     functional layer)
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(psTransfer, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannelTransferPeripheralToMemory);
 *      psTransfer.i16SrcReadOffset = 4U;
 *      psTransfer.bEnableSrcMinorLoopOffset = true;
 *      psTransfer.i32MinorLoopOffset = -16U;
 *      psTransfer.u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *
 *     Memory to peripheral, writing data from continuous memory block to 4 fifo
 *     @code
 *      EDMA_GetChannelDefaultTransferConfig(&psTransfer, srcAddr, dstAddr,4,
 *                                         256, kEDMA_TransferWidth32Bits, kEDMA_ChannrlTransferMemoryToPeripheral);
 *      psTransfer.i16DstOffsetOfEachTransfer = 4U;
 *      psTransfer.bEnableDstMinorLoopOffset = true;
 *      psTransfer.i32MinorLoopOffset = -16U;
 *      psTransfer.u16EnabledInterruptMask = kEDMA_ChannelMajorLoopCompleteInterruptEnable;
 *
 *      EDMA_GetDefaultConfig(&config);
 *      config.psChannelTransferConfig[0]= &psTransfer;
 *      EDMA_Init(DMA, channel, &config);
 *
 *      EDMA_EnableChannelRequest(base, channel, true);
 *     @endcode
 *
 *  @}
 */
/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief edma transactional tcd pool resource protection lock definition
 * Application should overwrite below two macros if multi task trying to access the same channel.
 */
#ifndef EDMA_ENTER_CRITICAL_SECTION
#define EDMA_ENTER_CRITICAL_SECTION()
#endif
#ifndef EDMA_LEAVE_CRITICAL_SECTION
#define EDMA_LEAVE_CRITICAL_SECTION()
#endif

/*! @brief Compute the offset unit from DCHPRI3 */
#define DMA_DCHPRI_INDEX(channel) (((channel) & ~0x03U) | (3U - ((channel)&0x03U)))

/*! @brief _edma_transfer_status eDMA transfer status
 *  @anchor _edma_transfer_status
 *  The enumerator used for transactional interface only.
 */
enum _edma_transfer_status
{
    kStatus_EDMA_ChannelQueueFull = MAKE_STATUS(kStatusGroup_EDMA, 0), /*!< TCD queue is full. */
    kStatus_EDMA_ChannelBusy      = MAKE_STATUS(kStatusGroup_EDMA, 1), /*!< Channel is busy and can't handle the
                                                                     transfer request. */
};

/*! @brief eDMA transfer type */
typedef enum _edma_channel_transfer_type
{
    kEDMA_ChannelTransferMemoryToMemory = 0x0U, /*!< Transfer type from memory to memory assume that the both source and
                                                   destination address are incremental */
    kEDMA_ChannelTransferPeripheralToMemory,    /*!< Transfer type peripher to memory assume that the source address is
                                                   fixed */
    kEDMA_ChannelTransferMemoryToPeripheral,    /*!< Transfer type from memory to peripheral assume that the destination
                                                   address is fixed */
    kEDMA_ChannelTransferPeripheralToPeripheral, /*!< Transfer type from Peripheral to peripheral assume that both
                                                    source and destination address are fixed */
} edma_channel_transfer_type_t;

/*! @brief eDMA interrupt source
 *
 * The eDMA peripheral support generate interrupt when half of the total request bytes transferred or
 * all of the request bytes transferred.
 *
 * @anchor _edma_channel_interrupt_enable
 *
 */
enum _edma_channel_interrupt_enable
{
    kEDMA_ChannelErrorInterruptEnable = 1U, /*!< Enable error interrupt */
    kEDMA_ChannelMajorLoopCompleteInterruptEnable =
        DMA_CSR_INTMAJOR_MASK, /*!< Enable interrupt while major count exhausted. */
    kEDMA_ChannelMajorLoopHalfCompleteInterruptEnable =
        DMA_CSR_INTHALF_MASK, /*!< Enable interrupt while major count to half value. */
    kEDMA_ChannelAllInterruptEnable = kEDMA_ChannelErrorInterruptEnable | DMA_CSR_INTMAJOR_MASK |
                                      DMA_CSR_INTHALF_MASK, /*!< Enable all the interrupt. */
};

/*!@brief _edma_channel_status_flags eDMA channel status flags.
 *  @anchor _edma_channel_status_flags
 */
enum _edma_channel_status_flags
{
    kEDMA_ChannelStatusErrorFlag = 0x1U, /*!< eDMA error flag, an error occurred in a transfer */
    kEDMA_ChannelStatusMajorLoopCompleteFlag =
        0x2U, /*!< Major loop complete flag, set while transfer finished, CITER value exhausted*/
    kEDMA_ChannelStatusMajorLoopHalfCompleteFlag = 0x4U, /*!< Major loop half complete flag */
};

/*! @brief _edma_error_status_flags eDMA channel detail error status flags.
 *   @anchor _edma_error_status_flags
 */
enum _edma_error_status_flags
{
    kEDMA_ChannelDestinationBusErrorFlag = DMA_ES_DBE_MASK, /*!< Bus error on destination address */
    kEDMA_ChannelSourceBusErrorFlag      = DMA_ES_SBE_MASK, /*!< Bus error on the source address */
    kEDMA_ChannelScatterGatherErrorFlag =
        DMA_ES_SGE_MASK,                            /*!< Error on the Scatter/Gather address, not 32byte aligned. */
    kEDMA_ChannelNbytesErrorFlag = DMA_ES_NCE_MASK, /*!< NBYTES/CITER configuration error */
    kEDMA_ChannelDestinationOffsetErrorFlag =
        DMA_ES_DOE_MASK, /*!< Destination offset not aligned with destination size */
    kEDMA_ChannelDestinationAddressErrorFlag =
        DMA_ES_DAE_MASK,                                   /*!< Destination address not aligned with destination size */
    kEDMA_ChannelSourceOffsetErrorFlag  = DMA_ES_SOE_MASK, /*!< Source offset not aligned with source size */
    kEDMA_ChannelSourceAddressErrorFlag = DMA_ES_SAE_MASK, /*!< Source address not aligned with source size*/
    kEDMA_ChannelErrorChannelFlag     = DMA_ES_ERRCHN_MASK, /*!< Error channel number of the canceled channel number */
    kEDMA_ChannelPriorityErrorFlag    = DMA_ES_CPE_MASK,    /*!< Channel priority is not unique. */
    kEDMA_ChannelTransferCanceledFlag = DMA_ES_ECX_MASK,    /*!< Transfer canceled */
#if defined(FSL_FEATURE_EDMA_CHANNEL_GROUP_COUNT) && (FSL_FEATURE_EDMA_CHANNEL_GROUP_COUNT > 1)
    kEDMA_ChannelGroupPriorityErrorFlag = DMA_ES_GPE_MASK, /*!< Group priority is not unique. */
#endif
    kEDMA_ChannelValidFlag = (int)DMA_ES_VLD_MASK, /*!< No error occurred, this bit is 0. Otherwise, it is 1. */
};

/*! @brief eDMA arbitration type */
typedef enum _edma_arbitration_type
{
    kEDMA_ArbitrationFixedPriority = 0x0U, /*!< channel arbitration by fixed priority  */
    kEDMA_ArbitrationRoundRobin,           /*!< Channel arbitration by round robin */
} edma_arbitration_type_t;

