nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.h
/*!@brief edma channel index */
typedef enum _edma_channel
{
    kEDMA_Channel0 = 0U, /*!< EDMA channel 0 */
    kEDMA_Channel1 = 1U, /*!< EDMA channel 1 */
    kEDMA_Channel2 = 2U, /*!< EDMA channel 2 */
    kEDMA_Channel3 = 3U, /*!< EDMA channel 3 */
} edma_channel_t;

/*! @brief eDMA transfer width configuration */
typedef enum _edma_channel_transfer_width
{
    kEDMA_ChannelTransferWidth8Bits   = 0U,   /*!< Source/Destination data transfer width is 1 byte every time */
    kEDMA_ChannelTransferWidth16Bits  = 1U,   /*!< Source/Destination data transfer width is 2 bytes every time */
    kEDMA_ChannelTransferWidth32Bits  = 2U,   /*!< Source/Destination data transfer width is 4 bytes every time */
    kEDMA_ChannelTransferWidth128Bits = 0x4U, /*!< Source/Destination data transfer size is 16 bytes every time */
} edma_channel_transfer_width_t;

/*! @brief eDMA channel modulo configuration
 *
 * The eDMA modulo feature can be used to specify the address range of the source/destination address, it is
 * useful to implement a circular data queue.
 */
typedef enum _edma_channel_modulo
{
    kEDMA_ChannelModuloDisable = 0x0U, /*!< Disable modulo */
    kEDMA_ChannelModulo2bytes,         /*!< Circular buffer size is 2 bytes. */
    kEDMA_ChannelModulo4bytes,         /*!< Circular buffer size is 4 bytes. */
    kEDMA_ChannelModulo8bytes,         /*!< Circular buffer size is 8 bytes. */
    kEDMA_ChannelModulo16bytes,        /*!< Circular buffer size is 16 bytes. */
    kEDMA_ChannelModulo32bytes,        /*!< Circular buffer size is 32 bytes. */
    kEDMA_ChannelModulo64bytes,        /*!< Circular buffer size is 64 bytes. */
    kEDMA_ChannelModulo128bytes,       /*!< Circular buffer size is 128 bytes. */
    kEDMA_ChannelModulo256bytes,       /*!< Circular buffer size is 256 bytes. */
    kEDMA_ChannelModulo512bytes,       /*!< Circular buffer size is 512 bytes. */
    kEDMA_ChannelModulo1Kbytes,        /*!< Circular buffer size is 1 K bytes. */
    kEDMA_ChannelModulo2Kbytes,        /*!< Circular buffer size is 2 K bytes. */
    kEDMA_ChannelModulo4Kbytes,        /*!< Circular buffer size is 4 K bytes. */
    kEDMA_ChannelModulo8Kbytes,        /*!< Circular buffer size is 8 K bytes. */
    kEDMA_ChannelModulo16Kbytes,       /*!< Circular buffer size is 16 K bytes. */
    kEDMA_ChannelModulo32Kbytes,       /*!< Circular buffer size is 32 K bytes. */
    kEDMA_ChannelModulo64Kbytes,       /*!< Circular buffer size is 64 K bytes. */
    kEDMA_ChannelModulo128Kbytes,      /*!< Circular buffer size is 128 K bytes. */
    kEDMA_ChannelModulo256Kbytes,      /*!< Circular buffer size is 256 K bytes. */
    kEDMA_ChannelModulo512Kbytes,      /*!< Circular buffer size is 512 K bytes. */
    kEDMA_ChannelModulo1Mbytes,        /*!< Circular buffer size is 1 M bytes. */
    kEDMA_ChannelModulo2Mbytes,        /*!< Circular buffer size is 2 M bytes. */
    kEDMA_ChannelModulo4Mbytes,        /*!< Circular buffer size is 4 M bytes. */
    kEDMA_ChannelModulo8Mbytes,        /*!< Circular buffer size is 8 M bytes. */
    kEDMA_ChannelModulo16Mbytes,       /*!< Circular buffer size is 16 M bytes. */
    kEDMA_ChannelModulo32Mbytes,       /*!< Circular buffer size is 32 M bytes. */
    kEDMA_ChannelModulo64Mbytes,       /*!< Circular buffer size is 64 M bytes. */
    kEDMA_ChannelModulo128Mbytes,      /*!< Circular buffer size is 128 M bytes. */
    kEDMA_ChannelModulo256Mbytes,      /*!< Circular buffer size is 256 M bytes. */
    kEDMA_ChannelModulo512Mbytes,      /*!< Circular buffer size is 512 M bytes. */
    kEDMA_ChannelModulo1Gbytes,        /*!< Circular buffer size is 1 G bytes. */
    kEDMA_ChannelModulo2Gbytes,        /*!< Circular buffer size is 2 G bytes. */
} edma_channel_modulo_t;

/*! @brief edma channel Bandwidth control
 *
 * Generally, as the eDMA processes the minor loop, it continuously generates read/write sequences
 * until the minor count is exhausted. This bandwidth field forces the eDMA to stall after the completion of
 * each read/write access to control the bus request bandwidth.
 *
 * The default configuration is kEDMA_BandwidthStallNone.
 */
typedef enum _edma_channel_bandwidth
{
    kEDMA_ChannelBandwidthStallNone   = 0x0U, /*!< No eDMA engine stalls. */
    kEDMA_ChannelBandwidthStall4Cycle = 0x2U, /*!< eDMA engine stalls for 4 cycles after each read/write. */
    kEDMA_ChannelBandwidthStall8Cycle = 0x3U, /*!< eDMA engine stalls for 8 cycles after each read/write. */
} edma_channel_bandwidth_t;

/*! @brief eDMA channel priority configuration, useful to the fixed priority arbitration type */
typedef struct _edma_channel_Preemption_config
{
    bool bSuspendedByHighPriorityChannel : 1; /*!< a channel can be suspended by other channel with higher priority */
    bool bSuspendLowPriorityChannel : 1;      /*!< a channel can suspend other channel with low priority */
    uint8_t u8ChannelPriority : 5;            /*!< Channel priority */
} edma_channel_Preemption_config_t;

/*! @brief edma channel software tcd definition */
typedef struct _edma_channel_tcd edma_channel_tcd_t;

/*! @brief edma channel transfer configuration
 *
 * The transfer configuration structure support full feature configuration of the transfer control descriptor.
 *
 * @note User should pay attention to the transfer size alignment limitation
 *       1. the u32BytesEachRequest should align with the  eSrcWidthOfEachTransfer and the eDstWidthOfEachTransfer
 *          that is to say u32BytesEachRequest % eSrcWidthOfEachTransfer should be 0
 *       2. the i16SrcOffsetOfEachTransfer and i16DstOffsetOfEachTransfer must be aligne with transfer width
 *       3. the u32TotalBytes should align with the u32BytesEachRequest
 *       4. the pSrcAddr should align with the eSrcWidthOfEachTransfer
 *       5. the pDstAddr should align with the eDstWidthOfEachTransfer
 *       6. the pSrcAddr should align with eSrcAddrModulo if modulo feature is enabled
 *       7. the pDstAddr should align with eDstAddrModulo if modulo feature is enabled
 *       If anyone of above condition can not be satisfied, the edma interfaces will generate assert error.
 *
 * 1.To perform a simple transfer, below members should be initialized at least
 * .pSrcAddr - source address
 * .pDstAddr - destination address
 * .eSrcWidthOfEachTransfer - data width of source address
 * .eDstWidthOfEachTransfer - data width of destination address, normally it should be as same as
 * eSrcWidthOfEachTransfer .u32BytesEachRequest - bytes to be transferred in each DMA request .u32TotalBytes - total
 * bytes to be transferred .i16SrcOffsetOfEachTransfer - offset value in bytes unit to be applied to source address as
 * each source read is completed .i16DstOffsetOfEachTransfer - offset value in bytes unit to be applied to destination
 * address as each destination write is completed bEnableChannelRequest - channel request can be enabled together with
 * transfer configure submission
 *
 * 2.The transfer configuration structure also support advance feature:
 * Programmable source/destination address range(MODULO)
 * Programmable minor loop offset
 * Programmable major loop offset
 * Programmable channel chain feature
 * Programmable channel transfer control descriptor link feature
 *
 */
typedef struct _edma_channel_transfer_config
{
    void *pSrcAddr; /*!< source address */
    void *pDstAddr; /*!< destination address */

    edma_channel_transfer_width_t eSrcWidthOfEachTransfer; /*!< source width of each transfer */
    edma_channel_transfer_width_t eDstWidthOfEachTransfer; /*!< destination width of each transfer */

    uint32_t u32BytesEachMinorLoop;           /*!< bytes in each minor loop or each request
                                               * range: 1 - (2^30 -1) when minor loop mapping is enabled
                                               * range: 1 - (2^10 - 1) when minor loop mapping is enabled and source or dest minor
                                               * loop offset is enabled
                                               * range: 1 - (2^32 - 1) when minor loop mapping is disabled
                                               */
    uint16_t u16MinorLoopCountsEachMajorLoop; /*!< minor loop counts in each major loop, should be 1 at least for each
                                               * transfer range: (0 - (2^15 - 1)) when minor loop channel link is
                                               * disabled range: (0 - (2^9 - 1)) when minor loop channel link is enabled
                                               * total bytes in a transfer = u16MinorLoopCountsEachMajorLoop *
                                               * u32BytesEachMinorLoop
                                               */
    uint16_t u16EnabledInterruptMask;         /*!< channel interrupt to enable, can be OR'ed value of @ref
                                                 _edma_channel_interrupt_enable */

    int16_t i16SrcOffsetOfEachTransfer;   /*!< Sign-extended offset value in byte unit applied to the current source
                                address to form the next-state   value as each source read is completed */
    edma_channel_modulo_t eSrcAddrModulo; /*!< source circular data queue range */
    int32_t i32SrcMajorLoopOffset;        /*!< source major loop offset */

