nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.h
    int16_t i16DstOffsetOfEachTransfer; /*!< Sign-extended offset value in byte unit applied to the current destination
                               address to form the next-state value as each destination write is completed. */
    edma_channel_modulo_t eDstAddrModulo; /*!< destination circular data queue range */
    int32_t i32DstMajorLoopOffset;        /*!< destination major loop offset */

    bool bEnableSrcMinorLoopOffset; /*!< enable source minor loop offset */
    bool bEnableDstMinorLoopOffset; /*!< enable dest minor loop offset */
    int32_t i32MinorLoopOffset;     /*!< burst offset, the offset will be applied after minor loop update */

    bool bEnableChannelMajorLoopLink;     /*!< channel link when major loop complete */
    edma_channel_t eMajorLoopLinkChannel; /*!< major loop link channel number */

    bool bEnableChannelMinorLoopLink;     /*!< channel link when minor loop complete */
    edma_channel_t eMinorLoopLinkChannel; /*!< minor loop link channel number */

    edma_channel_bandwidth_t eChannelBandWidth; /*!< channel bandwidth */

    bool bDisableRequestAfterMajorLoopComplete; /*!< the channel's ERQ bit can be cleared after the major loop complete
                                                  automatically */

    bool bEnableChannelRequest; /*!< enable the channel request signal */

    edma_channel_tcd_t *psLinkTCD; /*!< pointer to the link transfer control descriptor */
} edma_channel_transfer_config_t;

/*!
 * @brief eDMA software Transfer control descriptor structure.
 *
 * This structure is same as eDMA hardware channel TCD registers, user doesn't need to understand the
 * structures, since eDMA driver will responsible for configure it.
 *
 * The software TCD is useful to configure a software TCD which is linked by the channel hardware TCD to have
 * scatter/gather feature without using transactional interface.
 */
struct _edma_channel_tcd
{
    __IO uint32_t u32SADDR;  /*!< SADDR register, used to save source address */
    __IO uint16_t u16SOFF;   /*!< SOFF register, offset bytes added to source address every transfer */
    __IO uint16_t u16ATTR;   /*!< ATTR register, source/destination transfer size and modulo */
    __IO uint32_t u32NBYTES; /*!< Nbytes register, minor loop length in bytes */
    __IO uint32_t u32SLAST;  /*!< SLAST register, adjustment value added to the source address at the completion of the
                                major loop */
    __IO uint32_t u32DADDR;  /*!< DADDR register, used for destination address */
    __IO uint16_t u16DOFF;   /*!< DOFF register, offset bytes added to destination address every transfer */
    __IO uint16_t u16CITER;  /*!< CITER register, current minor loop numbers, for unfinished minor loop.*/
    __IO uint32_t u32DLAST_SGA; /*!< DLASTSGA register, next tcd address used in scatter-gather mode */
    __IO uint16_t u16CSR;       /*!< CSR register, for TCD control status */
    __IO uint16_t u16BITER;     /*!< BITER register, begin minor loop count. */
};

/*! @brief edma configuration structure
 *
 * This structure target for whole edma module configurations.
 */
typedef struct _edma_config
{
    bool bEnableContinuousLinkMode; /*!< Enable (true) continuous link mode. Upon minor loop completion, the channel
                                         activates again if that channel has a minor loop channel link enabled and
                                         the link channel is itself. */
    bool bEnableHaltOnError;        /*!< Enable (true) transfer halt on error. Any error causes the HALT bit to set.
                                         Subsequently, all service requests are ignored until the HALT bit is cleared.*/
    bool bEnableDmaInDebugMode;     /*!< Enable(true) eDMA debug mode. When in debug mode, the eDMA stalls the start of
                                         a new channel. Executing channels are allowed to complete. */
    bool bEnableMinorLoopMapping; /*!< TCDn.word2 is redefined to include individual enable fields, an offset field, and
                                     the NBYTES field. The individual enable fields allow the minor loop offset to be
                                     applied to the source address, the destination address, or both. The NBYTES field
                                     is reduced when either offset is enabled */
    edma_arbitration_type_t eArbitrationType; /*!< Enable (true) round robin channel arbitration method or fixed
                                                 priority arbitration is used for channel selection */
    edma_channel_Preemption_config_t
        sChannelPreemptionConfig[FSL_FEATURE_EDMA_MODULE_CHANNEL]; /*!< channel preemption configuration */

    edma_channel_transfer_config_t
        *psChannelTransferConfig[FSL_FEATURE_EDMA_MODULE_CHANNEL]; /*!< channel transfer configuration pointer */
} edma_config_t;

/*! @brief handler for eDMA */
typedef struct _edma_handle edma_handle_t;

/*! @brief Define callback function for eDMA.
 *
 * This callback function is called in the EDMA interrupt handler function.
 * In normal mode, running into callback function means the transfer users need is done.
 * In scatter gather mode, run into callback function means a transfer control block (tcd) is finished. Not
 * all transfer finished, users can get the finished tcd numbers using interface EDMA_GetUnusedTCDNumber.
 *
 * @param handle EDMA handle pointer, users shall not touch the values inside.
 * @param userData The callback user parameter pointer. Users can use this parameter to involve things users need to
 *                 change in EDMA callback function.
 * @param transferDone If the current loaded transfer done. In normal mode it means if all transfer done. In scatter
 *                     gather mode, this parameter shows is the current transfer block in EDMA register is done. As the
 *                     load of core is different, it will be different if the new tcd loaded into EDMA registers while
 *                     this callback called. If true, it always means new tcd still not loaded into registers, while
 *                     false means new tcd already loaded into registers.
 * @param tcds How many tcds are done from the last callback. This parameter only used in scatter gather mode. It
 *             tells user how many tcds are finished between the last callback and this.
 */
typedef void (*edma_transfer_callback_t)(edma_handle_t *psHandle,
                                         void *pUserData,
                                         bool bTransferDone,
                                         uint32_t u32Tcds);

/*! @brief eDMA transfer handle structure */
struct _edma_handle
{
    edma_transfer_callback_t pfCallback; /*!< Callback function for major count exhausted. */
    void *pUserData;                     /*!< Callback function parameter. */
    DMA_Type *psBase;                    /*!< eDMA peripheral base address. */
    edma_channel_tcd_t *psTcdPool;       /*!< Pointer to memory stored TCDs. */
    edma_channel_t eChannel;             /*!< eDMA channel number. */
    volatile uint8_t
        u8Header; /*!< The first TCD index. Should point to the next TCD to be loaded into the eDMA engine. */
    volatile uint8_t u8Tail; /*!< The last TCD index. Should point to the next TCD to be stored into the memory pool. */
    volatile uint8_t u8TcdUsed; /*!< The number of used TCD slots. Should reflect the number of TCDs can be used/loaded
                               in the memory. */
    volatile uint8_t u8TcdSize; /*!< The total number of TCD slots in the queue. */
};

