nxp-appcodehub/an-mc_pfc_56f83783/HVP_pmsm_pfc_MC56F83783/drivers/fsl_edma.h
/*******************************************************************************
 * APIs
 ******************************************************************************/
#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @name eDMA Initialization and De-initialization interfaces
 * @{
 */
/*!
 * @brief Get default edma peripheral configuration.
 *
 * @note This function will reset all of the configuration structure members to zero firstly,
 *       then apply default configurations to the structure.
 *
 * @param psConfig pointer to user's eDMA config structure, see edma_config_t for detail.
 */
void EDMA_GetDefaultConfig(edma_config_t *psConfig);

/*!
 * @brief EDMA initialization
 *
 * @param base eDMA peripheral base address.
 * @param psConfig pointer to user's eDMA config structure, see edma_transfer_config_t for detail.
 */
void EDMA_Init(DMA_Type *base, edma_config_t *psConfig);

/*!
 * @brief EDMA De-initialization
 *
 * @param base eDMA peripheral base address.
 */
void EDMA_Deinit(DMA_Type *base);

/*! @} */

/*!
 * @name eDMA non-channel functional interfaces
 * @{
 */

/*!
 * @brief Enable/Disable arbitration before the channel been activate by minor loop link trigger from itself.
 *
 * A minor loop channel link made to itself does not go through channel arbitration before being
 * activated again. Upon minor loop completion, the channel activates again if that channel has a
 * minor loop channel link enabled and the link channel is itself. This effectively applies the minor loop
 * offsets and restarts the next minor loop.
 *
 * @note Do not use continuous link mode with a channel linking to itself if there is only one minor loop
 * iteration per service request, for example, if the channel's NBYTES value is the same as either
 * the source or destination size. The same data transfer profile can be achieved by simply
 * increasing the NBYTES value, which provides more efficient, faster processing.
 *
 * @param base EDMA peripheral base address.
 * @param bEnable true is channel link to itself without arbitration
                  false is channel link to itself with arbitration
 */
static inline void EDMA_EnableContinuousChannelLinkMode(DMA_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CR |= DMA_CR_CLM_MASK;
    }
    else
    {
        base->CR &= ~DMA_CR_CLM_MASK;
    }
}

/*!
 * @brief Enable/Disable redefine the minor loop bytes register.
 *
 * The TCDn.word2 is redefined to include individual enable fields, an offset field and the
 * NBYTES field, the offset will be applied to source/destination address after minor loop complete
 *
 * @param base EDMA peripheral base address.
 * @param bEnable true is minor loop bytes register redefined to individual enable/offset/minor loop bytes fields.
 *                false is minor loop bytes register defined as minor loop bytes fields only.
 */
static inline void EDMA_EnableMinorLoopMapping(DMA_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CR |= DMA_CR_EMLM_MASK;
    }
    else
    {
        base->CR &= ~DMA_CR_EMLM_MASK;
    }
}

/*!
 * @brief Enable/Disable the eDMA halt when error occur feature.
 *
 * Any error causes the HALT bit to set will cause the EDMA halt. Subsequently, all service requests are ignored until
 * the HALT bit is cleared
 *
 * @param base EDMA peripheral base address.
 * @param bEnable true is Stall the start of any new channels when error occur.
 *                false is eDMA service request operation normal when error occur.
 */
static inline void EDMA_EnableHaltOnError(DMA_Type *base, bool bEnable)
{
    if (bEnable)
    {
        base->CR |= DMA_CR_HOE_MASK;
    }
    else
    {
        base->CR &= ~DMA_CR_HOE_MASK;
    }
}

/*!
 * @brief set EDMA arbitration type to fixed priority or round robin.
 *
 * @param base EDMA peripheral base address.
 * @param eArbitration, arbitration by priority or round robin, @ref edma_arbitration_type_t.
 */
static inline void EDMA_SetArbitration(DMA_Type *base, edma_arbitration_type_t eArbitration)
{
    base->CR = (base->CR & (~DMA_CR_ERCA_MASK)) | DMA_CR_ERCA(eArbitration);
}

/*! @} */

/*!
 * @name eDMA channel functional interfaces
 * @{
 */

/*!
 * @brief Get channel default transfer configuration.
 *
 * @note 1. This function will reset all of the configuration structure members to zero firstly,
 *       then apply default configurations to the structure.
 *       2. No interrupt enabled by this function by default, if application would like to use DMA interrupt
 *          please enable it manually by psTransfer->u16EnabledInterruptMask = _edma_channel_interrupt
 *
 * @param psConfig pointer to user's eDMA channel configure structure, see edma_channel_transfer_config_t for detail.
 * @param pSrcAddr source address, must be byte address.
 * @param pDstAddr destination address,  must be byte address.
 * @param u32BytesEachRequest bytes to be transferred in each request(namely, in each minor loop).
 * @param u32TotalBytes total bytes to be transferred.
 * @param eTransferWidth, it represents how many bits are transferred in each read/write.
 * @param eTransferType eDMA channel transfer type.
 */
void EDMA_GetChannelDefaultTransferConfig(edma_channel_transfer_config_t *psTransfer,
                                          void *pSrcAddr,
                                          void *pDstAddr,
                                          uint32_t u32BytesEachRequest,
                                          uint32_t u32TotalBytes,
                                          edma_channel_transfer_width_t eTransferWidth,
                                          edma_channel_transfer_type_t eTransferType);

/*!
 * @brief EDMA set channel transfer configurations
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param psTransfer pointer to user's eDMA channel configure structure, see edma_channel_transfer_config_t for detail.
 *
 * @note
 * 1.This function must not be called while the channel transfer is ongoing
 * or it causes unpredictable results.
 * 2.The psLinkTCD must be configured before invoke this API if scatter/gather function is needed
 * 3.The edma channel request may be enabled after the channel transfer configure done according to the transfer
 *   configurations.
 *
 */
void EDMA_SetChannelTransferConfig(DMA_Type *base, edma_channel_t eChannel, edma_channel_transfer_config_t *psTransfer);

/*!
 * @brief Configures the eDMA channel minor loop offset value.
 *
 * The minor offset means that the signed-extended value is added to the source address or destination
 * address after each minor loop.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param bEnableSrcMinorLoopOffset, true is enable source address minor offset, otherwise is disable
 * @param bEnableDestMinorLoopOffset, true is enable source address minor offset, otherwise is disable
 * @param i32MinorLoopOffset , minor loop offset value.
 */
void EDMA_SetChannelMinorLoopOffset(DMA_Type *base,
                                    edma_channel_t eChannel,
                                    bool bEnableSrcMinorLoopOffset,
                                    bool bEnableDestMinorLoopOffset,
                                    int32_t i32MinorLoopOffset);

/*!
 * @brief Configures the eDMA channel preemption configurations.
 *
 * This function configures the channel preemption attribute and the priority of the channel.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number
 * @param bSuspendedByHighPriorityChannel, true is the channel can be suspended by high priority channel, otherwise
 * cannot.
 * @param bSuspendLowPriorityChannel, true is the channel can suspend low priority channel, otherwise cannot.
 * @param priority, channel priority.
 *
 * @note, this function is used only in fixed-priority channel arbitration mode.
 */
void EDMA_SetChannelPreemption(DMA_Type *base,
                               edma_channel_t eChannel,
                               bool bSuspendedByHighPriorityChannel,
                               bool bSuspendLowPriorityChannel,
                               uint8_t u8Priority);

/*!
 * @brief Enable the minor loop channel link and configure the linked channel number.
 *
 * This function configures the minor link mode. The minor link means that the channel link is
 * triggered every time that the minor loop bytes transferred complete.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param eLinkChannel The linked channel number.
 * @note Users should ensure that DONE flag is cleared before calling this interface, or the configuration is invalid.
 */
void EDMA_EnableMinorLoopChannelLink(DMA_Type *base, edma_channel_t eChannel, edma_channel_t eLinkChannel);

/*!
 * @brief Disable the minor loop channel link for the eDMA transfer.
 *
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 */
static inline void EDMA_DisableMinorLoopChannelLink(DMA_Type *base, edma_channel_t eChannel)
{
    base->TCD[eChannel].CITER_ELINKYES &= ~DMA_CITER_ELINKYES_LINKCH_MASK;
    base->TCD[eChannel].BITER_ELINKYES &= ~DMA_CITER_ELINKYES_LINKCH_MASK;
}

/*!
 * @brief Enable the major loop channel link and configure the linked channel number.
 *
 * This function configures the major link mode. The major link means that the channel link is triggered when the CITER
 * is exhausted.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param eLinkChannel The linked channel number.
 * @note Users should ensure that DONE flag is cleared before calling this interface, or the configuration is invalid.
 */
void EDMA_EnableMajorLoopChannelLink(DMA_Type *base, edma_channel_t eChannel, edma_channel_t eLinkChannel);

/*!
 * @brief Disable the major loop channel link for the eDMA transfer.
 *
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 */
static inline void EDMA_DisableMajorLoopChannelLink(DMA_Type *base, edma_channel_t eChannel)
{
    base->TCD[eChannel].CSR &= ~DMA_CSR_MAJORLINKCH_MASK;
}

/*!
 * @brief Sets the edma channel stall cycles after each R/W.
 *
 * Because the eDMA processes the minor loop, it continuously generates read/write sequences
 * until the minor count is exhausted. The bandwidth forces the eDMA to stall after the completion of
 * each read/write access to control the bus request bandwidth seen by the crossbar switch.
 *
 * @note:
 * 1.If the source and destination sizes are equal, this field is ignored between the first and second
 * transfers and after the last write of each minor loop. This behavior is a side effect of reducing
 * start-up latency.
 * 2.When executing a large, zero wait-stated memory-to-memory transfer, insert bandwidth control
 * using the TCD_CSR[BWC] bits to avoid:
•*   Starvation of another master accessing the memory.
•*   Any delay in writing a TCD duloop the transfer.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param eBandWidth A bandwidth setting, which can be one of the @edma_channel_bandwidth_t
 */
void EDMA_SetChannelBandWidth(DMA_Type *base, edma_channel_t eChannel, edma_channel_bandwidth_t eBandWidth);

/*!
 * @brief Sets the source address range and the destination address range for the eDMA transfer.
 *
 * This function defines a specific address range of source/destination address, after the source/destination address
 * hits the range boundary, source/destination address will wrap to origin value.
 *
 * Setting this field provides the ability
 * to implement a circular data queue easily. For data queues require loop power-of-2 size bytes, the
 * queue should start at a 0-modulo-size address and the SMOD field should be set to the appropriate
 * value for the queue, freezing the desired number of upper address bits. The value programmed into
 * this field specifies the number of lower address bits allowed to change
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param eSrcModulo A source modulo value.
 * @param eDestModulo A destination modulo value.
 */
void EDMA_SetChannelModulo(DMA_Type *base,
                           edma_channel_t eChannel,
                           edma_channel_modulo_t eSrcModulo,
                           edma_channel_modulo_t eDestModulo);

/*!
 * @brief Enables the edma channel async request in stop mode.
 *
 * The EARS register is used to enable or disable the DMA requests in Enable Request
 * Register (ERQ) by AND'ing the bits of these two registers in stop mode only.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param bEnable The command to enable (true) or disable (false).
 */
static inline void EDMA_EnableChannelAsyncRequestInStopMode(DMA_Type *base, edma_channel_t eChannel, bool bEnable)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    if (bEnable)
    {
        base->EARS |= (1UL << eChannel);
    }
    else
    {
        base->EARS &= ~(1UL << eChannel);
    }
}

/*!
 * @brief Enables the edma channel auto disable request after major loop complete.
 *
 * The eDMA hardware automatically clears the corresponding ERQ bit when the current
 * major iteration count reaches zero.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param bEnable The command to enable (true) or disable (false).
 */
static inline void EDMA_EnableChannelAutoStopRequest(DMA_Type *base, edma_channel_t eChannel, bool bEnable)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    base->TCD[eChannel].CSR =
        (uint16_t)((base->TCD[eChannel].CSR & (~DMA_CSR_DREQ_MASK)) | DMA_CSR_DREQ((true == bEnable ? 1U : 0U)));
}

/*!
 * @brief Configures the eDMA channel major loop offset feature.
 *
 * Adjustment value added to the source/destination address at the completion of the major iteration count
 *
 * @param base eDMA peripheral base address.
 * @param eChannel edma channel number.
 * @param i32SourceOffset source address offset.
 * @param i32DestOffset destination address offset.
 */
void EDMA_SetChannelMajorLoopOffset(DMA_Type *base,
                                    edma_channel_t eChannel,
                                    int32_t i32SourceOffset,
                                    int32_t i32DestOffset);

/*!
 * @brief Enable/disable the eDMA hardware channel request.
 *
 * This function enables the hardware channel request.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param bEnable true is start, false is stop.
 */
static inline void EDMA_EnableChannelRequest(DMA_Type *base, edma_channel_t eChannel, bool bEnable)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    if (bEnable)
    {
        base->SERQ = DMA_SERQ_SERQ(eChannel);
    }
    else
    {
        base->CERQ = DMA_CERQ_CERQ(eChannel);
    }
}

/*!
 * @brief Starts the eDMA transfer by using the software trigger.
 *
 * This function starts a minor loop transfer only, the channel will halt when minor loop complete, so application
 * should re-call the function to start the transfer again.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 */
static inline void EDMA_SoftwareTriggerChannelStart(DMA_Type *base, edma_channel_t eChannel)
{
    assert(eChannel < (uint32_t)FSL_FEATURE_EDMA_MODULE_CHANNEL);

    base->SSRT = DMA_SSRT_SSRT(eChannel);
}

/*!
 * @brief Gets the remaining major loop count from the eDMA current channel TCD.
 *
 * This function checks the TCD (Transfer Control Descriptor) status for a specified
 * eDMA channel and returns the number of major loop count that has not finished.
 *
 * @param base eDMA peripheral base address.
 * @param channel eDMA channel number.
 * @retval Major loop count which has not been transferred yet for the current TCD.
 * @note 1. This function can only be used to get unfinished major loop count of transfer without
 *          the next TCD, or it might be inaccuracy.
 *       2. The unfinished/remaining transfer bytes cannot be obtained directly from registers while
 *          the channel is running.
 *          Because to calculate the remaining bytes, the initial NBYTES configured in DMA_TCDn_NBYTES_MLNO
 *          register is needed while the eDMA IP does not support getting it while a channel is active.
 *          In another word, the NBYTES value reading is always the actual (decrementing) NBYTES value the dma_engine
 *          is working with while a channel is running.
 *          Consequently, to get the remaining transfer bytes, a software-saved initial value of NBYTES (for example
 *          copied before enabling the channel) is needed. The formula to calculate it is shown below:
 *          RemainingBytes = RemainingMajorLoopCount * NBYTES(initially configured)
 */
uint32_t EDMA_GetChannelRemainingMajorLoopCount(DMA_Type *base, edma_channel_t eChannel);

/*! @} */

/*!
 * @name eDMA Channel interrupt Interfaces
 * @{
 */
/*!
 * @brief Enables the edma channel interrupts according to a provided mask,
 *        the mask is a logical OR of enumerator members @ref _edma_channel_interrupt_enable.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param u16InterruptsMask the mask is a logical OR of enumerator members see _edma_channel_interrupt_enable.
 * @param bEnable true is enable, false is disable.
 *
 */
void EDMA_EnableChannelInterrupts(DMA_Type *base, edma_channel_t eChannel, uint16_t u16InterruptsMask, bool bEnable);

/*! @} */

/*!
 * @name eDMA Channel Status Interfaces
 * @{
 */

/*!
 * @brief Gets the eDMA channel status flags.
 *
 * @note if the function return error status, application can call @ref EDMA_GetErrorStatusFlags for
 *       the detail error status.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @retval The mask of channel status flags. Users need to use the
 *         _edma_channel_status_flags type to decode the return variables.
 */
uint16_t EDMA_GetChannelStatusFlags(DMA_Type *base, edma_channel_t eChannel);

/*!
 * @brief Clears the eDMA channel status flags.
 *
 * @param base eDMA peripheral base address.
 * @param eChannel eDMA channel number.
 * @param u16StatusFlags The mask of channel status to be cleared. Users need to use
 *             the defined _edma_channel_status_flags type.
 */
void EDMA_ClearChannelStatusFlags(DMA_Type *base, edma_channel_t eChannel, uint16_t u16StatusFlags);

/*!
 * @brief Gets the eDMA channel error status flags.
 *
 * @param base eDMA peripheral base address.
 * @return The mask of error status flags. Users need to use the
 *         @ref _edma_error_status_flags type to decode the return variables.
 */
static inline uint32_t EDMA_GetErrorStatusFlags(DMA_Type *base)
{
    return base->ES;
}

/* @} */

/*!
 * @name eDMA software TCD Interfaces
 * @{
 */
/*!
 * @brief Sets TCD fields according to the user's channel transfer configuration structure, @ref
 * edma_channel_transfer_config_t.
 *
 * Application should be careful about the TCD pool buffer storage class,
 * - For the platform has cache, the software TCD should be put in non cache section
 * - The TCD pool buffer should have a consistent storage class.
 *
 * @note Application should be careful when using the minor loop offset feature with this function, please make sure the
 * EMLM bit is asserted, although EDMA_InitChannel will set this bit by default, if the bit is cleared, application can
 *       use @ref EDMA_EnableMinorLoopMapping to enable the feature.
 *
 * @param psTcd Pointer to the TCD structure.
 * @param psTransfer channel transfer configuration pointer.
 *
 * @note This function enables the auto stop request feature.
 */
void EDMA_ConfigChannelSoftwareTCD(edma_channel_tcd_t *psTcd, edma_channel_transfer_config_t *psTransfer);

/*!
 * @brief Push content of software TCD structure into hardware TCD register.
 *
 * @param base EDMA peripheral base address.
 * @param eChannel EDMA channel number.
 * @param psTcd Point to TCD structure.
 */
void EDMA_InstallChannelSoftwareTCD(DMA_Type *base, edma_channel_t eChannel, edma_channel_tcd_t *psTcd);

/*! @} */

/*!
 * @name eDMA Transactional Interfaces
 */

/*!
 * @brief Creates the eDMA channel handle.
 *
 * This function is called if using the transactional API for eDMA. This function
 * initializes the internal state of the eDMA handle.
 *
 * @param base eDMA peripheral base address.
 * @param handle eDMA handle pointer. The eDMA handle stores callback function and
 *               parameters.
 * @param channel eDMA channel number.
 * @param psTcdPool A memory pool to store TCDs. It must be 32 bytes aligned.
 * @param u32TcdCount The number of TCD slots.
 * @param callback eDMA callback function pointer.
 * @param userData A parameter for the callback function.
 *
 */
void EDMA_TransferCreateHandle(DMA_Type *base,
                               edma_handle_t *psHandle,
                               edma_channel_t eChannel,
                               edma_channel_tcd_t *psTcdPool,
                               uint32_t u32TcdCount,
                               edma_transfer_callback_t pfCallback,
                               void *pUserData);

/*!
 * @brief Submits the eDMA single transfer configuration.
 *
 * Application can submit single transfer when
 * 1. channel is idle, the transfer request will be submitted to eDMA channel TCD register directly
 * 2. channel is idle, a previous transfer request is pending, the new transfer request will be submitted to the
 * installed TCD pool and linked to the pending one.
 * 3. channel is active, the transfer request will be submitted to the installed TCD pool and linked to previous one.
 *
 * @note,
 * 1.Please be aware of that tcd pool maintain is unprotect by default, that is to say, the behavior of multiple task
 * trying to access the same channel is undefine, application can protect the channel by itself or overwrite
 * EDMA_ENTER_CRITICAL_SECTION/EDMA_LEAVE_CRITICAL_SECTION to have edma driver protect the TCD pool maintain.
 * 2.Since the destination major loop offset feature register is reused as scatter gather tcd address, so the two
 * features cannot be used together, if the destination major loop offset feature is used, then the transfer request
 * will be submit hardware TCD directly.
 *
 * It is suggest that application should check the return value of this function to make sure that the transfer request
 * is submitted successfully.
 *
 * @param psHandle eDMA handle pointer.
 * @param psTransfer pointer to user's eDMA channel configure structure, see edma_channel_transfer_config_t for detail.
 *
 * @retval #kStatus_EDMA_Success It means submit transfer request succeed.
 * @retval #kStatus_EDMA_QueueFull It means TCD queue is full. Submit transfer request is not allowed.
 */
status_t EDMA_TransferSubmitSingleTransfer(edma_handle_t *psHandle, edma_channel_transfer_config_t *psTransfer);

